{
  "name": "AMP Validator Slack Bot",
  "description": "Slack bot which validates AMP articles against the Cloudflare AMP Validator API.",
  "repository": "https://github.com/JamesIves/amp-validator-slack-bot",
  "keywords": [
    "python",
    "slack",
    "slack-bot",
    "cloudflare",
    "cloudflare-api"
    "cloudflare-amp-validator",
    "amp",
    "google-amp",
    "amp-validator",
    "chartbeat"
    ],
    "website": "https://jamesiv.es",
    "env": {
      "BOT_ID": {
        "description": "The ID of your Slack bot user, this is required so the bot knows when a command is directed at it. If you're unsure what your bot ID is you can run bot_id.py which will print the ID, you'll need to make sure that the BOT_NAME field within the file corresponds with the one you setup in the Slack interface.",
        "value": ""
      },
      "SLACK_BOT_TOKEN": {
        "description": "The bot token found within the Slack API settings.",
        "value": ""
      },
      "CHARTBEAT_ENDPOINT": {
        "description": "If you run Chartbeat analytics you can test your top performing pages against the Chartbeat API. This field requires an endpoint that you can find in your Chartbeat API settings, for more information see the Chartbeat part of the readme.",
        "value": ""
      },
      "CHARTBEAT_INTERVAL_TIME": {
        "description": "If you'd like to periodically check the pages returned from the Chartbeat API without any user input you can enter an interval time for it to do so. This will silently check the pages and only alert if an error is found. Requires CHARTBEAT_OUTPUT_CHANNEL and CHARTBEAT_ENDPOINT to be entered for this to function. Requires a numeric value, for example 60 for 60 minutes.",
        "value": "60"
      },
      "CHARTBEAT_OUTPUT_CHANNEL": {
        "description": "If you'd like the interval check to work you need to enter a channel in order for errors to be logged to. Please see the Slack API documentation on how to format this.",
        "value": ""
      }     
    }
  }
}
